siat_folder/Siat/xml/solicitud-cuf.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="https://siat.impuestos.gob.bo/">
	<SOAP-ENV:Body>
		<ns1:cufd>
			<SolicitudCufd>
				<codigoAmbiente>2</codigoAmbiente>
				<codigoModalidad>2</codigoModalidad>
				<codigoPuntoVenta>0</codigoPuntoVenta>
				<codigoSistema>6D307F64485BE20AEB91C0F</codigoSistema>
				<codigoSucursal>0</codigoSucursal>
				<cuis>CAC33D71</cuis>
				<nit>9665224017</nit>
			</SolicitudCufd>
		</ns1:cufd>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>