Cui.php

https://pilotosiatservicios.impuestos.gob.bo/v2/FacturacionCodigos

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:siat="https://siat.impuestos.gob.bo/">
    <soapenv:Header/>
    <soapenv:Body>
        <siat:cuis>
            <SolicitudCuis>
                <codigoAmbiente>2</codigoAmbiente>
                <codigoModalidad>2</codigoModalidad>
                <!--Optional:-->
                <codigoPuntoVenta>1</codigoPuntoVenta>
                <codigoSistema>352292DA539485215BBE</codigoSistema>
                <codigoSucursal>0</codigoSucursal>
                <nit>555441026</nit>
            </SolicitudCuis>
        </siat:cuis>
    </soapenv:Body>
</soapenv:Envelope>

apiKey
TokenApi eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJzdWIiOiJheWFsYWVkc29uMjAxM0BnbWFpbC5jb20iLCJjb2RpZ29TaXN0ZW1hIjoiMzUyMjkyREE1Mzk0ODUyMTVCQkUiLCJuaXQiOiJINHNJQUFBQUFBQUFBRE0xTlRVeE1UUXdNZ01BbnFhbE1Ba0FBQUE9IiwiaWQiOjUwNjIzNzIsImV4cCI6MTc2NzIxMDc2NywiaWF0IjoxNzU4NjcxNTM3LCJuaXREZWxlZ2FkbyI6NTU1NDQxMDI2LCJzdWJzaXN0ZW1hIjoiU0ZFIn0.g5L5FEVm6OUo0h1nzlf3iATSp_THBZMVWFU8nPsgzooncshKMnhILmg5O8m5T6UqG-sbDUWNE6ClIquVW0uPRw